Тест_ЗУП_31_КОРП/src/Catalogs/СменыРаботыСотрудников/СменыРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СменыРаботыСотрудников</name>
  <owners>Catalog.РежимыРаботыСотрудников</owners>
  <tabularSections>
    <name>Расписание</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени</name>
      <type>
        <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПереходящиеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/СменыРаботыСотрудников/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Элементы.Владелец.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыРасписание

&НаКлиенте
Процедура РасписаниеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока 
		И Объект.Расписание.Количество() > 1 Тогда
		
		ИндексПредыдущейСтроки = Элементы.Расписание.ТекущиеДанные.НомерСтроки - 2;
		
		Элементы.Расписание.ТекущиеДанные.ВремяНачала = Объект.Расписание[ИндексПредыдущейСтроки].ВремяОкончания;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВремяНачалаПриИзменении(Элемент)
	 ЗаполнитьДлительностьИнтервала(Элементы.Расписание.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеВремяОкончанияПриИзменении(Элемент)
	ЗаполнитьДлительностьИнтервала(Элементы.Расписание.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДлительностьИнтервала(СтрокаРасписания)
	Секунды = СтрокаРасписания.ВремяОкончания - СтрокаРасписания.ВремяНачала;
	СтрокаРасписания.Часы = Секунды / 3600;
	
	ВремяНачалаСмены = Объект.Расписание[0].ВремяНачала;
	Если СтрокаРасписания.ВремяНачала < СтрокаРасписания.ВремяОкончания Тогда
		Если СтрокаРасписания.НомерСтроки = 1 
			Или СтрокаРасписания.ВремяНачала > ВремяНачалаСмены Тогда	
			
			СтрокаРасписания.Часы = (СтрокаРасписания.ВремяОкончания - СтрокаРасписания.ВремяНачала) / 3600;
			СтрокаРасписания.ПереходящиеЧасы = 0;
		Иначе	
			СтрокаРасписания.Часы = (СтрокаРасписания.ВремяОкончания - СтрокаРасписания.ВремяНачала) / 3600;
			СтрокаРасписания.ПереходящиеЧасы = СтрокаРасписания.Часы;	
		КонецЕсли;	
	Иначе	
		СтрокаРасписания.ПереходящиеЧасы = (СтрокаРасписания.ВремяОкончания - '00010101') / 3600;
		СтрокаРасписания.Часы = ('00010101235959' - СтрокаРасписания.ВремяНачала + 1) / 3600 + СтрокаРасписания.ПереходящиеЧасы;
	КонецЕсли;		
КонецПроцедуры	

#КонецОбласти
